14М_OCEDT_33/src/Documents/ПриходТовара/ПриходТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходТовара</name>
  <registerRecords>AccumulationRegister.Товары</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

14М_OCEDT_33/src/Documents/ПриходТовара/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	ТекстСообщения = "Изменено количество";
	
	РассчитатьСуммуСтроки(ТекущиеДанные, ТекстСообщения);
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные, ТекстСообщения)
	
	ТекущиеДанные.Сумма = ТекущиеДанные.Количество * ТекущиеДанные.Цена;
	
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = ТекстСообщения;
	Сообщение.УстановитьДанные(ЭтотОбъект);
	Сообщение.Сообщить();
	
	МояСтруктураПример = СоздатьСтруктуру();
	
КонецПроцедуры

// Создать структуру.
// 
// Возвращаемое значение:
//  Структура - Создать структуру:
// * Строка - Строка - 
// * Дата сегодня - Дата - 
// * Сумма - Число - 
// * Булево - Булево - 
&НаКлиенте
Функция СоздатьСтруктуру()
	
	Структ = Новый Структура;
	Структ.Вставить("Строка", "Привет мiр!" );
	Структ.Вставить("Дата сегодня", ТекущаяДата());
	Структ.Вставить("Сумма", 2 + 2 );
	Структ.Вставить("Булево", Истина );
	
	Возврат Структ;
	
КонецФункции

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	ТекстСообщения = "Изменена цена";
	
	РассчитатьСуммуСтроки(ТекущиеДанные, ТекстСообщения);
	
КонецПроцедуры
